{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PUFPaY9KxDAcGqfsorJp3Q", "review_id": "Ya85v4eqdd6k9Od8HbQjyA", "stars": 4, "date": "2012-08-01", "text": "Mr Hoagie is an institution. Walking in, it does seem like a throwback to 30 years ago, old fashioned menu board, booths out of the 70s, and a large selection of food. Their speciality is the Italian Hoagie, and it is voted the best in the area year after year. I usually order the burger, while the patties are obviously cooked from frozen, all of the other ingredients are very fresh. Overall, its a good alternative to Subway, which is down the road.", "type": "review", "business_id": "5UmKMjUEUNdYWqANhGckJw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Iu6AxdBYGR4A0wspR9BYHA", "review_id": "KPvLNJ21_4wbYNctrOwWdQ", "stars": 5, "date": "2014-02-13", "text": "Excellent food. Superb customer service. I miss the mario machines they used to have, but it's still a great place steeped in tradition.", "type": "review", "business_id": "5UmKMjUEUNdYWqANhGckJw"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "auESFwWvW42h6alXgFxAXQ", "review_id": "fFSoGV46Yxuwbr3fHNuZig", "stars": 5, "date": "2015-10-31", "text": "Yes this place is a little out dated and not opened on the weekend. But other than that the staff is always pleasant and fast to make your order. Which is always spot on fresh veggies on their hoggies and other food. They also have daily specials and ice cream which is really good. I had a banana split they piled the toppings on. They win pennysaver awards ever years i see why.", "type": "review", "business_id": "5UmKMjUEUNdYWqANhGckJw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qiczib2fO_1VBG8IoCGvVg", "review_id": "pVMIt0a_QsKtuDfWVfSk2A", "stars": 3, "date": "2015-12-26", "text": "PROS: Italian hoagie was delicious.  Friendly counter employee. The restaurant was clean and neat. \n\nCONS: The pizza was not good.  Pre-formed crust, NOT fresh dough.  The price of the failure of a pizza WAS NOT CHEAP EITHER.  \n\nI guess the name says it all.  Get the hoagie, pass on the pizza.", "type": "review", "business_id": "5UmKMjUEUNdYWqANhGckJw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qEE5EvV-f-s7yHC0Z4ydJQ", "review_id": "AEyiQ_Y44isJmNbMTyoMKQ", "stars": 2, "date": "2016-04-08", "text": "First the only reason this place could possibly win best hoagie is because there's no competition. Two hoagies and a side of onion rings cost $25.74\n\nSo I'm thinking with the reader choice awards and $10 per 12\" hoagie these will be awesome. \n\nI was sadly mistaken. \n\nThe only reason I didn't give one star is because is the bread & dressing is fairly decent. \n\nSo on to the hoagies, the Italian is general run of the mill. Minimal meat and a ton of shredded lettuce. You get more meat at subway. Nothing really special & NOT worthy of the $10 price tag. \n\nSecond, the steak hoagie, it is atrocious. \nNo cheese?!?!? You have to add cheese for $1 so now the steak hoagie is $11. That has so little amounts of meat that I thought I was eating a lettuce & onion hoagie. I am thoroughly disappointed with this hoagie, possibly the worst value of a hoagie I've ever eaten. \nI'm not say eating at subway is any better, but for the huge price difference you are better off doing so. \nCheck out pasquales down the road, better hoagie & price.", "type": "review", "business_id": "5UmKMjUEUNdYWqANhGckJw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jBoH6qKGO7wdYyg_YjBcQA", "review_id": "V-bqYx62zpxfH2oFkzXPzw", "stars": 1, "date": "2016-04-10", "text": "Normally, I do not do reviews of an establishment unless the rating is exceptionally great or exceptionally bad.  If I had not felt sucker punched and mugged after I left Mr. Hoagie, I would not be writing this bad review.  On my first and last trip there, I paid $24.59 for two whole hoagies.  \n\n1) The Italian (ordered because the woman (she) working there told me it was their most popular hoagie) I ordered with lettuce and onions (no tomato, italian dressing which all come free with the hoagie).  I had to pay $1 to add cheese to the hoagie.  Because I was traveling and would not be eating the hoagie right away, I asked for the italian on the side.  She told me there was a charge for the dressing on the side.  I passed on that on principle.  Are you kidding me?  I just saved her money by declining the tomato.  I was not going to pay for the dressing on the side.  At this point, I am certain something is not right and this place appears to me to be in financial trouble.  That pales in comparison to what happened next.  I opened the hoagie and there were three microscopically thin slices of meat on this hoagie.  Ham, salami, and bologna.  Bologna!?!?!?!?    Who in the hell puts disgusting bologna on an Italian hoagie?  That disqualifies that hoagie as an Italian.  The red flags indicating this place is in financial trouble are blinding my view.  One area of this hoagie only had one slice of bologna, no ham and no salami.\n\n2)  The Steak hoagie came with nothing on it but lettuce, tomato, onions, and dressing.  I ordered it without lettuce, tomato, onions, or dressing.  I asked for mayo on the side.  I had to pay for that so I declined.  Are you kidding me?  I just saved them money by passing on the lettuce, tomato, fresh onions, and dressing!  I paid $3 to add sautéed mushrooms, onions, and cheese.  Here we go again.  Canned mushrooms that were not even cooked through (were still cold) and onions that were still crunchy/undercooked.  News flash:  you need to serve fresh mushrooms that have been sautéed (canned mushrooms are another sign this place is in financial trouble).  I literally had to open the hoagie to find the steak because I could not taste or see it.  The hoagie was 50% mushrooms, 30%onions, 10% cheese and 10% steak.\n\nI could have personally made 10 whole hoagies with substantial quality ingredients and toppings for the $24.59 I paid for these two whole hoagies.  I intentionally patronize non-chain restaurants to support small businesses.  In this case, Never. Again.  (The hoagie bun was better than average.)  Wake up or you are going to lose your business.", "type": "review", "business_id": "5UmKMjUEUNdYWqANhGckJw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bWrodc7hN_T4q2r-rolrOA", "review_id": "3saY_LVFUpkAfd9t86VNdw", "stars": 4, "date": "2016-05-11", "text": "I like this place a lot. It's a good toasted hoagie.\n\nI actually don't like a my bun exploding with meat, but as a previous poster mentioned if you do maybe you wouldn't like this place.\n\nThe inside badly needs updated though. \n\nThe staff is friendly.", "type": "review", "business_id": "5UmKMjUEUNdYWqANhGckJw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uK8tzraOp4M5u3uYrqIBXg", "review_id": "Di3exaUCFNw1V4kSNW5pgA", "stars": 5, "date": "2013-11-08", "text": "All the food is great here. But the best thing they have is their wings. Their wings are simply fantastic!!  The \"Wet Cajun\" are by the best & most popular.  I also like the seasoned salt wings.  Wing Night is Monday & Wednesday night, $0.75 whole wings!\n\nThe dining area is nice. Very family friendly! The bar is very nice is well.  This place is truly a Yinzer's dream!!  \"Pittsburgh Dad\" would love this place n'at!!", "type": "review", "business_id": "UsFtqoBl7naz8AVUBZMjQQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I_47G-R2_egp7ME5u_ltew", "review_id": "0Lua2-PbqEQMjD9r89-asw", "stars": 3, "date": "2014-03-29", "text": "We checked this place out this past Monday for their wing night. We have heard that their wings are great and decided it was finally time to check it out. Their wings are whole wings and crispy, which is a nice change of pace. I got their wet Cajun sauce and garlic butter wings. The Cajun did not have a bold enough flavor for me and their sauce is too thin. The sauce was also thin for the garlic butter, but that is more expected. They were better than average, but I don't like seeing all the sauce resting at the bottom of the boat. I would definitely come try this place out again to sample some of the other items on the menu, but this will probably not become a regular stop for wings anytime soon.", "type": "review", "business_id": "UsFtqoBl7naz8AVUBZMjQQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PP_xoMSYlGr2pb67BbqBdA", "review_id": "7N9j5YbBHBW6qguE5DAeyA", "stars": 1, "date": "2014-10-29", "text": "Wing sauce is like water. Pretty much a lot of butter and some hot sauce (franks red hot maybe).  The whole wings are good size and crispy, but for $1 a wing the sauce could be better. The hot and extra hot are about the same flavor/heat.  The fish sandwich is good and is a large portion, sides are decent.", "type": "review", "business_id": "UsFtqoBl7naz8AVUBZMjQQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JPPhyFE-UE453zA6K0TVgw", "review_id": "mjCJR33jvUNt41iJCxDU_g", "stars": 4, "date": "2014-11-28", "text": "Cold cheap beer. Good bar food. Good service. \n\nLooking for a great Pittsburgh style fish sandwich, this is the place to go. The breading is light, fish is more than plentiful and a good side of home cut fries. \n\nGood grilled chicken salads or steak.  Soup of day is homemade and lots of specials. Great place for lunch or bar snacks and beer.", "type": "review", "business_id": "UsFtqoBl7naz8AVUBZMjQQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pl78RcFgklDns8atQegwVA", "review_id": "kG7wxkBu62X6yxUuZ5IQ6Q", "stars": 2, "date": "2016-02-24", "text": "Possibly the most overhyped establishment in Allegheny County. If you're not a regular, you will be ignored by those who're tending bar. Beer selection is okay, the prices are good and the service is terrible. I would go here, but only if it was someone else's idea.", "type": "review", "business_id": "UsFtqoBl7naz8AVUBZMjQQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fhNxoMwwTipzjO8A9LFe8Q", "review_id": "XsA6AojkWjOHA4FmuAb8XQ", "stars": 3, "date": "2012-08-19", "text": "Decent range somewhat close to the city.  The mats are pretty solid; however, the grass range needs to be tended too.  It's like hitting out of US Open type rough...not very amenable to practicing.  Which kind of defeats the purpose of going to a golf range...Still gets 3 stars because the range is lit up at night which is excellent for those of us who are addicted to this amazing game, but are somewhat short on time (having a job kinda sucks sometimes, no?).", "type": "review", "business_id": "cE27W9VPgO88Qxe4ol6y_g"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-6rEfobYjMxpUWLNxszaxQ", "review_id": "rkD7UDbQ9VM3Va6bI-eBHQ", "stars": 1, "date": "2013-04-18", "text": "Owning a driving range inside the city limits is like a license to print money.  I don't think I ask much out of a driving range.  Decent mats, clean balls and accessible hours.  Hell you need even less people now with the advent of the machine that doles out the balls.  This place has none of them.  It is april and there are no grass tees yet.  BTW they opened for the season this week although it has been golfing weather for a month.  The mats look like the carpet at my 107 year old aunt Irene's house.  Worn and thread bare.  Let's talk about the hours.  This place is equipped with lights yet they only sell buckets of balls until 730.  It is still light out.  Finally lets you have the pit to hit into.  When I arrived I wasn't sure if this was a driving range or an excavation site for a mastodon or a strip mining operation.  There is no grass on the range. Just mud.  Makes it a good tool to figure out how far you actually are hitting the ball.  Oh, they are cash only also.\n\nBottom line, this place sucks.  The best hope is that the owner sells it to someone that actually wants to make money and service golfers in Pittsburgh.", "type": "review", "business_id": "cE27W9VPgO88Qxe4ol6y_g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KZuaJtFindQM9x2ZoMBxcQ", "review_id": "WExNE-f93SL4D1q8s9QWKg", "stars": 1, "date": "2013-07-14", "text": "This place is absolute garbage...  Half of the tees are not available, including all the grass tees.  It is cash only, and they sell the last bucket at 8, despite having lights.  And if you finish even a minute after 8, don't plan on getting a drink.  The vending machines are sold out (of course) and they sell drinks inside, but close the drawers at 8 on the dot.  There are weeds grown all over the place.  I noticed some sort of batting cage, but it looks like those are out of order as well.  Someone should buy this place and turn it into what it should be.", "type": "review", "business_id": "cE27W9VPgO88Qxe4ol6y_g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H9E5VejGEsRhwcbOMFknmQ", "review_id": "iS34GJhMkkt9kCoTJLYEwA", "stars": 4, "date": "2013-08-16", "text": "Before I finally made it over to this range I heard the same thing from most people - it's just fine to go work on your swing. I had such a low expectation I was pleasantly surprised. \n\nIt's a fairly big range - if you are familiar with Scally's in Moon, it seems like it has almost as many tees, though its not nearly as nice a facility. \n\nThe guys in the pro shop were two of the friendlier guys I've come across at ranges or at courses. Yards were indeed marked and there are some targets to aim for, and even some hazards to aim away from. \n\nA big red flag to me was the extra charge ($3) to hit off the grass. I am no range expert, but this is the 4th one I've been to and the first I've seen of that sort of nickel and diming....\n\nPrice for the golf balls was reasonable and I do plan to be back every week until they close up in October for the season. Hopefully, since its for sale, it will reopen as a golf facility again.", "type": "review", "business_id": "cE27W9VPgO88Qxe4ol6y_g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ljwgUJowB69klaR8Au-H7g", "review_id": "S-G0D8Cy7PnqShoBZu8PCA", "stars": 4, "date": "2014-07-11", "text": "I drove by yesterday to get a sneak peak.  It re-opens on July 14th and I can't wait to take my kids.  The new range looks amazing.  The entire range appears to be turf, which may or many not help your game, but it looks really nice.  The tee boxes look state of the art and the club house looks like something you'll see on a newer course.  Can't wait to experience it!", "type": "review", "business_id": "cE27W9VPgO88Qxe4ol6y_g"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "LWbYpcangjBMm4KPxZGOKg", "review_id": "6w6gMZ3iBLGcUM4RBIuifQ", "stars": 5, "date": "2012-12-01", "text": "This place was DELICIOUS!!  My parents saw a recommendation to visit this place from Rick Sebak's \"25 Things I Like About Pittsburgh\" and he's usually pretty accurate.  His recommendations were to try the Reuben, Fish Sandwich and Open-Faced Steak Sandwich.  We went early afternoon for a late lunch today (a Saturday) and were seated right away.  The staff is extremely friendly.  My Mom & I each had the fish sandwich, while my Dad & Brother had a Reuben sandwich.  The fish was very good, but the Reuben was to die for!  Both dishes were massive, and could very easily be shared between two people.  On top of being extremely large portions, it was incredibly affordable.  The giant fish sandwich was $8 and the giant Reuben was $7.50.  Our drinks were always filled and we were checked on several times during the meal.  We will definitely be back!!!  Oh and a bit of advice ahead of time - they take CASH ONLY.  So come prepared, but I'm pretty sure I saw an ATM there as well.  And I do believe they are closed on Sundays & Mondays.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m1FpV3EAeggaAdfPx0hBRQ", "review_id": "jVVv_DA5mCDB6mediuwHAw", "stars": 5, "date": "2013-03-15", "text": "Can't miss stop for the best Fish Sandwich in Pittsburgh.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "8fApIAMHn2MZJFUiCQto5Q", "review_id": "3Es8GsjkssusYgeU6_ZVpQ", "stars": 5, "date": "2013-03-30", "text": "This place should have a lot more reviews - but I'm glad it doesn't, they don't need to get any busier.\n\nIts been there ages, and looks it. If you're all about ambiance, don't bother. If you pretend you're in a movie set in Pittsburgh 30 years ago it works pretty well. The service is sometimes hit or miss. Most of girls are good, one is very slow, one is amazing. They are all friendly and usually a few different people will check in to make sure that you're happy. Everything is made fresh so be prepared that nothing comes flying out of that kitchen - busy times it can take a good while to get food. \n\nThe food is AWESOME! Worth any little complaints I might think up before it gets there. Once its on the table, I forget them all.\n\n-Fish Sandwiich\n-Salmon (huge and delicious)\n-Flounder\n-Shrimp a few ways (\"Norfolk\" style is oily for my taste, and I never had it growing up in Norfolk.)\n-Hawkins St Special\n-Prime Rib (sized for two, watch it)\n\nThe prices are low, the portions are large, and just about everything on the menu  is delicious. I'm not one to pick a place because they give you a lot of food, but if you like a good value and don't want to compromise on taste, this place is a gem.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uK8tzraOp4M5u3uYrqIBXg", "review_id": "KAkcn7oQP1xX8KsZ-XmktA", "stars": 4, "date": "2013-10-20", "text": "This place was very good. I found out about Emil's when watching a show called \"25 Things I Love About Pittsburgh\" on WQED hosted by Rick Seback. This place ain't a luxurious restaurant...it's a beer & a shot bar / lounge. But the people are friendly & the food is good. I had the fish sandwich which was great. It ain't in a great part of town, Rankin, but I've been in worse places!! Try this place.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6wvlM5L4_EroGXbnb_92xQ", "review_id": "BZNJkkP0bXnwQ2-sCqat2Q", "stars": 5, "date": "2013-11-07", "text": "Old school.....traditional \"mom 'n pop\" quality and perfection. The best fish and chips you'll ever enjoy and equally superb fried shrimp. A great out of the way, non-corporate, vestige of Americana. You will love it.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "345nDw0oC-jOcglqxmzweQ", "review_id": "VDTIbR3G5_IPkpXbo2MutA", "stars": 5, "date": "2014-03-22", "text": "Seen this restaurant on 25 best places in Pittsburgh with Rick Seback\nack. Went there with my girlfriend she grew up with the owner. She's very nice all employees are super nice service was excellent i had the fish sandwich my girlfriend had the Ruben more than you could possibly eat very reasonable prices. Going back to try the burgers  i heard there enormous and very tasty.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u9ULAsnYTdYH65Haj5LMSw", "review_id": "5uyYmniYyIB_wtKtyXDudQ", "stars": 4, "date": "2014-09-29", "text": "Wonderful reuben.  Map shown on Yelp page is incorrect. It is actually a different Hawkins.  I'd recommend a call for directions 412-271-9911.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pdHC0oAcG7gNdhuFRAUu0Q", "review_id": "zyn_Libz9VZTZ--OdC4-tQ", "stars": 5, "date": "2014-09-29", "text": "Good fish sandwich.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "tAKjY3bQXH51msJbOHYPmQ", "review_id": "uf61rPucuICXhSPXlZ1hIQ", "stars": 5, "date": "2014-11-03", "text": "After a morning of Thrift Store hunting, a friend and I were thinking of lunch, and he suggested Emil's after he'd seen Chris Sebak do a bit on it and had tried it a time or two before, and I had not. He said they had a decent Reuben, but to be prepared to step back in time.\n\nWell, seeing as how I'm kind of addicted to late 40's and early 50's, and the whole Rat Pack scene, stepping back in time is a welcomed change in da burgh...as long as it doesn't involve 1979, which I can see all around me every day.\n\nAnd yet another shot at finding a decent Reuben in da burgh...well, that's like hunting the Holy Grail. So looking under one more bush certainly wouldn't hurt.\n\nSo off we go right at lunchtime in the middle of...where exactly were we? At first I thought we were lost, driving around a handful of very rather dismal looking blocks in what looked like a neighborhood that had been blighted by the building of a highway. And then...AHA! Here it is! And yep, there it was. This little unassuming building with an add-on entrance with what looked like a very old hand painted sign stating quite simply 'Emil's. \n\nWe walked in the front door, and entered another world. Another time, and another place. Oh, and any Big Burrito/Sousa foodies might as well stop reading now. I wouldn't want to see you walk in, roll your eyes and say 'Reaaaaaalllly?'\n\nThis is about as old world bar/lounge/restaurant as it gets. Plain, with a dark wood bar on one side, plain white walls with no yinzer pics, good sturdy chairs and actual white linens on the tables. This is the kind of neighborhood dive that I could see Frank and Dino pulling a few tables together for some poker, a fish sammich, and some cheap scotch. And THAT is exactly what I love.\n\nOh...but good food counts too. \n\nWe each had a Reuben, and my friend had a side of fries. The Reubens were decent, but not NY awesome. A little too thick on the bread, but overall, tasty and definitely filling. Not too skimpy on the meat. I seriously CRAVE a true, good NY Reuben, but since I can't afford to travel right now, what I find in da burgh will have to do. But as we sat and ate, burgers came out to an adjoining table. Those were some big thick burgers. A steak went past for the table behind us. That was HUGE! And when we asked about it, the waitress said 'Yeah, it's huge and really good, and he only charges $12.99 for it, ain't that nuts?' Another table of five came in, and wham. Fish sandwiches PILED with breaded fish that looked amazing. Yeah, I want that, that, that and THAT!\n\nMy friend also mentioned that they have a Chicken Parm special one day of the week that is only served UNTIL 4 pm, and that it is fantastic. If only I could GET there on that week day before 4...\n\nThe waitress did a good job, especially since there was quite a growing crowd at lunchtime on a Saturday, and only one of her. She kept up and was very friendly. \n\nThey only have Pepsi products, so I had a brewed iced tea, which was very fresh, and she did pop by to ask about refills as often as she could. As the lunch hour went on, they were getting busy.\n\nEmil's is no frills, good portions, very reasonable prices, VERY comfortable neighborhood hole in the wall...kind of like Cheers, but in a blue collar neighborhood in the 1950's. Fan-freakin-tastic! I could feel at home here.\n\nYou definitely want to hit Mapquest or plug in your GPS though. I am not sure that I could find it again on my own...it really is a hidden gem. I will be making my friend take me back until I can memorize where the heck it is.\n\nAddendum: 2nd visit for the fish sandwich. Excellent. Truly. A pound of fish on a fish-shaped bun (as opposed to da burgh's seemingly popular hamburger bun). The fish was flavorful, the batter excellent, and for just $8. This may have been the best fish sandwich I've yet to have in da burgh.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Kq8-FUG7d_MT2qRNiNBJnA", "review_id": "xY2gjy49dnpQSB2RTZzqCw", "stars": 4, "date": "2014-12-18", "text": "This is a hidden gem, no really. It took us forever to find but well worth it. It is right across the street from the Rankin Police Station. The menu has a wide selection, I really couldn't decide what I wanted but I went with the ribeye sandwich. I'm glad i did too. Huge sandwich! I added mushrooms, it was very flavorful. My boyfriend got the fish sandwich, he enjoyed it as well. Fast and friendly service. Will definitely be back.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 1, "useful": 1, "cool": 4}, "user_id": "a0ULPTNi05w-BNVovVUz2w", "review_id": "1W1vq7D1ofwFKbCA_GWu_A", "stars": 5, "date": "2015-03-06", "text": "From reading the other reviews, I see this place was on some top 25 places in Pittsburgh list a few years ago.  I haven't seen it myself, but have known of this place for a while before my first visit in 2013.  It wasn't until my almost 80yo buddy, Mr. Italo Donatucci (world's coolest old Italian dude) brought me one of the best fish sandwiches I ever had that I became hooked!  I've had at least 10 since then, but only during the Lent season.  I gave my 5 rating based on the fish sandwich alone.  Try it without a bun also!  Either way you get 3 nice size pieces of fish equal to a pound.  You can have your choice of sides, but I always get the small mac n cheese for my side.  The staff is always really friendly and service is prompt.  It's in a rough neighborhood, but the Rankin police station is right across the street.  Almost every visit there I have seen police officers inside mingling with the locals or picking up lunch orders.  Soon I plan to make a visit that's not a Friday during Lent to try other menu items.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-ke0O45_B6STtEqd5s_ANw", "review_id": "6A5nASW8_XRwDxV29cWGUQ", "stars": 4, "date": "2015-03-08", "text": "Another divey place we have been going to for years. My dad's favorite, as he knows the original owners. Certain items on the menu are named after the kids. Huge portions, might have a bit of a wait some nights. Huge burgers, fish sandwiches, salads. Decent service.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FoFdGS2TjVUUXptBS_gdNQ", "review_id": "RgYjyaOkSY1b5r9wirrfIQ", "stars": 4, "date": "2015-03-16", "text": "Love my hometown favorites. Cannot beat their fish sandwiches (although I do miss the buns as opposed to the sliced bread...stop that). Always will support Emil's\nOther favorites include Reuben, Hawkins Avenue sandwich, Chrissy Club.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XN5PALUxEOxgUrhaXXAJzA", "review_id": "mzafz6umneP5CBkzHGGsfQ", "stars": 5, "date": "2015-05-27", "text": "Emil's is a great place to eat! The prices are VERY reasonable, the portions are HUGE and everything I have ever ordered has been tasty and well prepared. The people who work there are so friendly, as are the customers who eat there. Ample free parking makes it easy to go there. I didn't worry about the area- the police station is right across the street. Don't leave the Burgh without having (1) their fish sandwich, and (2) their Reuben. You will be glad you ate there!", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E5O8wsWiGLqoOVBmG84wcw", "review_id": "boU6hZwK-As9Zf7YHVq4GA", "stars": 5, "date": "2015-07-02", "text": "I love everything about this place. The food is delicious (yes yes, the fish sandwiches, OK, I agree -- but DID YOU TRY THE MEATBALLS?? holy tamoley), I adore the staff, and I love that there are no windows -- it's its own little hermetically sealed 1950s world of delicious, real food and good people. Lots of places try to create this kind of ambiance, but it can't be manufactured. It takes decades of good food and good vibes.\n\nAlso, the food is really good. :)", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "k0a-uii8yr__Rl-9ipl_RA", "review_id": "e11K8g-0m66gDeRz3TgSIQ", "stars": 5, "date": "2015-11-06", "text": "I had a hankering for some fried fish tonight and the fish fry at Maximilian Kolbe was going to close before I got home on the bus, and I suggested to my wife and 12 year-old daughter that we try Emil's lounge as WQED's Rick Seback loved the place as did Andrew Zimmern when he visited for the Bizarre Foods America episode featuring Pittsburgh.  \n\nThe place is in Rankin - a rough around the edges town in the Mon Valley between Swissvale and Braddock.  Don't be put off at first - the outside doesn't have much decoration to speak of and looks like the sort of place that you might think twice about it.  A TGI Fridays it isn't... And thank god for that.\n\nThe place is well-kept but a little dated -  no fripperies here.  But we're not here for the Decor - we're here for some dinner.  \n\nThe menu is basic with reasonable prices.  The meats and seafood are high quality and everything is made to order.  Their stuffed cabbage is regarded as the best in  Pittsburgh.  I love stuffed cabbage but I just made a batch a couple of weeks ago and I'm cabbaged out.  Their Ruebens are   also killer (our waitress raved about them).  My wife and I both settled on fish sandwiches.  These are true Pittsburgh fish Sammiches - fresh fried fish in crispy breading, crammed between enormous pillows of soft, yet chewy and crispy Mancini's Italian bread.  No adornments - just a boatload of hot crispy fish.  Emil's uses thick cod fillets piled high rather than a thin fillet that needs to be broken up to fit in the bun.  Truly a great sandwich.  My daughter had the BLT - looked good and on good bread and they weren't skimpy with the bacon.\n\nThe service was very pleasant and friendly and the crowd was a great group of folks.  We all had fun with 4 other tables when my wife pulled up a Trivial Pursuit game on her iPhone and pretty much everyone joined in and had a good laugh.\n\nOverall, if you consider yourself a true Pittsburgher - you must visit this place.  It's one of the few places (Big Jim's in the Run is another) where the spirit of Pittsburgh is alive and hungry.  Please go.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LQUy7D5Bzb2WutEXhVg2Tw", "review_id": "MKEs8po2_DFt9msCp8w68A", "stars": 5, "date": "2015-12-04", "text": "We have been coming here for over 30 years, consistantly good food and friendly staff. Vwey reasonably priced and large portions. The owner, Chrissy has taken what Emil started years ago and built it into a place we will return to again and again. Favorites are the fish and burgers, hard to pick one!", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rtKuu--pSi1fkUekrVSVAg", "review_id": "GBz2JXMIypoBbVtSIH_r4w", "stars": 5, "date": "2015-12-15", "text": "We had gone to the Frick Mansion for a tour and I told my friends we were stopping off for a lunch in Rankin. There wasn't much enthusiasm about the location but the reluctantly agreed.  We stopped in front and my wife said we aren't going in there are we? Well once the order the food and enjoyed the best Reuben,  fish sandwich and stuffed peppers they were sold. The owner came over and thanked us for stopping. She is a real asset to the place. The restrooms were spotless, which important to my wife. I have taken places where she had to hover  over the commode. I went back two days later for the hulushki. A real gem a perfect place to eat real comfort food. Don't forget the liver and onions.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qiczib2fO_1VBG8IoCGvVg", "review_id": "v59hvgI7A2EkFFuGkWZksQ", "stars": 5, "date": "2015-12-16", "text": "Excellent fish sandwich, Wonderful Reuben Sandwich, even the stuffed cabbage tastes homemade.   Chrissy \nIs a delightful hostess and makes you feel welcome.  Restaurant personnel are pleasant.   I really enjoy visiting Emils when I'm in town   My only regret is that they are closed Mondays.   Worth the trip", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fRMPvlxxMaEAHrQu5fP2cw", "review_id": "Pm6hPvRnV7dLMHpp7Yf9Wg", "stars": 3, "date": "2016-01-21", "text": "I wouldnt say the best fish sandwich ive ever had...definitely a huge portion but rather bland and nothing special. Very nice people and good service but i would largely disagree with most of the reviews here. Atmosphere was quite drab, classic western pa corner bar but no windows, poorly lit, and overall fairly dismal.... Clientele seemed to be on deaths door, missing limbs and morbidly obese. Fries were frozen and under cooked. Meatballs were dry and bland as well. I had high hopes but left feeling disappointed, defeated, bloated and like i had swallowed the entire rustbelt in one bite...", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5OumCBQ_MyQsltSdbMyunA", "review_id": "vtqE5Sy9qk74qiS6ybleoQ", "stars": 5, "date": "2016-02-22", "text": "This is my fourth time but my first review. It never disappoints! Always home cooking, old school like grandma's house. Don't expect ambiance, but if you're hungry and want nice wait staff, (usually family) squeaky clean, great value and generous portions-way more than I can ever finish, Emil's is your place.\n\nTonight I had a cup of the chicken dumpling soup that was sooooo good! Very obviously home made. I had a side of onion rings that were perfectly cooked, which doesn't sound fancy, but I still couldn't finish. My husband had the chicken parm. Thursday is Italian night. It came with a huge salad, very fresh, an entire loaf of Italian bread, and a generous portion of nicely crisped and tender chicken breasts. Added to that, a side helping of ziti. My husband enjoyed it very much, the chicken was perfectly cooked. I'm a sauce snob, Italian, allergic to with an aversion to green peppers. To me, there was just a hint of green pepper in the sauce so I probably would avoid anything with red sauce at Emil's but that's just my quirk. I've had the stuffed cabbages there, the fried fish, Ruebens, burgers - all wonderful! Emil was and his family is of Serbian decent. Food is love. We love Emils!", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "09jLk1V4_0Cg9FJc97luHQ", "review_id": "oZvG231a9J_wzX_HRMzWtw", "stars": 5, "date": "2016-03-13", "text": "I remember the old man 20 years ago eating a giant size hamburger used asked me questions I miss those days food there is spectacular the fish is to die at four if you never been there just put it on your schedule of your things to do and I promise you you won't be sorry.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hAT1Y7gf71TPJ6S-hRTO8Q", "review_id": "wjFPIigHK6I0qaBEypilRA", "stars": 4, "date": "2016-04-07", "text": "Great food  & service every visit. They do so many things right there especially taking care of the customers.  I have always received a hello, a follow up on my food, a thank you and then a good bye.  Some many restaurants get away from these simple steps of service. I'm glad Emil's has not.", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j9wgdbO7uToEr7Yb4MwnOw", "review_id": "SFeWP61QfW_lgpa2n9LzNw", "stars": 5, "date": "2016-05-08", "text": "This is our second time here in two weeks.  We have always liked Emil's, but just haven't been out this way lately.  This is now going to change.  Last week we had the wonderful fish - it has always been good.  Last week we stopped on a Tuesday after golf.  The bartender recommended the special of the day - the Chicken Romano with garlic and olive oil pasta.  It was truly outstanding!  I can't wait to go back and have it again!  The homemade Tomato soup with Asiago cheese was delicious as well.  Thanks Chef Tony!", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j9wgdbO7uToEr7Yb4MwnOw", "review_id": "PxrT9BbjY4QzRINGgT_0qw", "stars": 5, "date": "2016-07-08", "text": "Chicken Romano (yes, again - it's that good). My husband had the Shrimp stuffed with crab - wow! Love, love! Thanks KK, great suggestions!", "type": "review", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XN5PALUxEOxgUrhaXXAJzA", "review_id": "5iMYI_FQDtbSRJNkbniSaA", "stars": 5, "date": "2015-05-27", "text": "I like this course. It's always very well maintained. The carts are in excellent shape, all electric and all equipped with GPS. The greens fees are extremely reasonable and many of the holes are challenging, even if you are a better golfer. It truly has a grand view up and down the Mon, from the Triangle and the Cathedral of Learning to Braddock, the Edgar Thompson Works, Kennywood and beyond. Yet, when you go a few more feet on the cart path, you are in the woods, alone with the abundant wildlife. One caveat- bring an abundant supply of balls. If you golf like I do, one sleeve will not be enough!", "type": "review", "business_id": "mYSpR_SLPgUVymYOvTQd_Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JRWpliEmVN3ghyh9NQr1yA", "review_id": "XGObgnRNEOPMyQ3B9lAlhg", "stars": 5, "date": "2016-04-26", "text": "2nd time playing here. Was in the area for a bowling tournament so a group of us decided to come early and get a round of golf in. The course is hilly and challenging with readable and fairly flat greens. But, as the name suggests, what a Grand View of both the course as well as the surrounding areas. \nCarts are in excellent shape and provide you with electronic scoring and course GPS.  The folks here take pride in their course and take very good care of it.", "type": "review", "business_id": "mYSpR_SLPgUVymYOvTQd_Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BkSeJo9g0s1YY7FSPqXSyg", "review_id": "5idUtnXsCzXDYECjaRphqA", "stars": 5, "date": "2016-07-10", "text": "Challenging but fun course! Bring plenty of extra balls, I am a novice and lost at least 5. Carts are in great condition and remind you to stay on the cart path (sometimes annoying when looking for balls but safety first) and guide you to the next hole. The pro was very nice and patient with our group as we had to delay teeing off for an hour due to parkway closures. Driving range is nothing to write home about but gets the job done for warming up. Beautiful views and lots of variety of length and layout of holes. I'll definitely be back!", "type": "review", "business_id": "mYSpR_SLPgUVymYOvTQd_Q"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "ay9H1RpjbBkaiXGxfh7LaA", "review_id": "v_uEDbK5fP1UJpkXNPwXpQ", "stars": 4, "date": "2010-10-11", "text": "This would be my local haunt, if I were ever to relocate to the Pittsburgh area. What a great little place! Such friendly staff, and some damn good eats!\n \nIt was so great, that we actually went there twice during our 4-day vacation to catch the Steelers/Ravens game. \n\nThey have daily sandwich specials. On Thursday night we went and had the special roast beef and cheese sand., and the .35 cent wings. Very, very tasty. I'm sorry, but this place kicks Primanti Bros. butt on the taste factor. They have about 8 different types of wings... reg., garlic, and I can't remember the rest - we got the regular, and I was wishing we would had ordered more.\n\nGoing back on a Friday night, we ordered the buffalo chicken pizza and a pepperoni n' mushroom.  Wow! That buffalo chicken pizza was awesome.\n\nThe other thing that stuck out for me was one of the customers. An older gentleman; he seemed to be a regular. I really, really wanted his SPAM t-shirt.", "type": "review", "business_id": "KayYbHCt-RkbGcPdGOThNg"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "JbWnXwjLaO1kncUkQOMajg", "review_id": "j8GuxQJ_DQsSfrJNkmcACA", "stars": 4, "date": "2011-02-27", "text": "A great townie bar with tasty food and an interesting clientele. I went to check this place out on the way home from the airport one Friday night and it didn't disappoint. It is refreshing to walk into a townie bar and not feel like the music stops and everyone in the place is staring at you - I'm guessing the mixed crowd of older hockey fans, young men in collared shirts, and thirtysomethings have probably seen it all during their time at this place. \n\nThe staff was top notch - the orders were somewhat overwhelming as they appeared short-staffed for the night, but my waitress tried to keep a positive attitude for my entire visit. The other waiter was wearing a hooded cardigan, and I wanted to steal it from him due to my difficulty in finding such a quality article of clothing.\n\nWe ordered a white pizza - large in size, engulfed in cheese, full of garlic flavor, flavorful hot sausage. An overall delicious pizza, aside from 2 things: 1, way too much grease (I know this comes with the territory, but still, it is sometimes unbearable); 2, CANNED MUSHROOMS - the worst thing to come out of a can. Ever. I would rather eat canned Alpo than canned mushrooms. And if the mushrooms weren't canned, they were just the worst mushrooms I've ever consumed. The mushroom debacle is enough to lower the review by an entire star - disgusting!\n\nMy advice for the place is keep everything awesome - random music from the jukebox, tasty food, great prices, good crowd and staff - and get some decent mushrooms; why they spoil an otherwise above average pie with such inferior crap, I'll never know.", "type": "review", "business_id": "KayYbHCt-RkbGcPdGOThNg"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "4-3IU5uUH90m21TWbZhhnA", "review_id": "2xCds3bp0wM6nHMz3H65vg", "stars": 4, "date": "2011-08-15", "text": "Alexion's has been around forever.  The first time I went in there, I was 19 years old on summer break from college and working at the ice cream factory up the hill.  All of the union guys from the ice cream factory went in there after work, and I immediately found out why.  MANY, MANY years later, I stopped in there with some fond memories, and once again felt welcomed and valued as a customer, even though they didn't know who I was.  THE SANDWICHES are done Pittsburgh-style, sort of like Primanti's, and they are as perfect today as they were back in ancient times when I first started visiting the place.  Alexion's is a clean and peaceful little place in the Rook Station part of Green Tree, the oldest part of the town.  I recall that some of the sandwiches I got there were ordered at a pretty late hour.  Nothing but good things to say about the place, and I wish it was closer to home!", "type": "review", "business_id": "KayYbHCt-RkbGcPdGOThNg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bcwr1bFov3PSa1FiGfpc9g", "review_id": "UrukGX1emhSRe2fGdxdVPA", "stars": 3, "date": "2011-12-22", "text": "Good for cheap drinks and wings, they offer daily specials which is nice. \n\nDoesnt look like much from outside but the inside is friendly enough, the bartenders have been there for awhile and do a good job. Dont expect to have a HUGE selection of alcohol. \n\nTheir wings are good as are their salads. If you are gluten free this is not your place...lots of fried food and sandwiches. \nOffers a quick lunch.", "type": "review", "business_id": "KayYbHCt-RkbGcPdGOThNg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Sjb5e5-gKoLXueFDMc2R8Q", "review_id": "2_Ru_ASf75kU303rdQjFfQ", "stars": 4, "date": "2013-04-25", "text": "What a cool bar/restaurant.. I will no doubt be visiting again.  The service and prices were great.. and the restrooms were clean.   I had the buffalo chicken sandwich and it was delicious.  The menu consists of typical bar food food, however; theres a few different items on there which stand out on the menu..\n\nA cool bar off the beaten path that is a worth a trip.  \n\nCheers ! !", "type": "review", "business_id": "KayYbHCt-RkbGcPdGOThNg"}